GroundUpwind/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }
}

// SIMPLE
// {
//     residualControl
//     {
//         p               1e-4;
//         U               1e-4;
//         "(k|omega|e)"   1e-4;
//     }

//     nNonOrthogonalCorrectors 0;
//     pMinFactor      0.1;
//     pMaxFactor      2;
// }

relaxationFactors
{
    fields
    {
        p               0.7;
        rho             0.01;
    }
    equations
    {
        U               0.3;
        e               0.7;
        "(k|omega)"     0.7;
    }
}

// ************************************************************************* //
